RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_OCOTP.h
#define OCOTP_OUT_STATUS_CLR_DED_RELOAD_MASK     (0x100000U)
#define OCOTP_OUT_STATUS_CLR_DED_RELOAD_SHIFT    (20U)
/*! DED_RELOAD - Indicates double error detection occured on reload */
#define OCOTP_OUT_STATUS_CLR_DED_RELOAD(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_DED_RELOAD_SHIFT)) & OCOTP_OUT_STATUS_CLR_DED_RELOAD_MASK)

#define OCOTP_OUT_STATUS_CLR_CALIBRATED_MASK     (0x200000U)
#define OCOTP_OUT_STATUS_CLR_CALIBRATED_SHIFT    (21U)
/*! CALIBRATED - Calibrated status */
#define OCOTP_OUT_STATUS_CLR_CALIBRATED(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_CALIBRATED_SHIFT)) & OCOTP_OUT_STATUS_CLR_CALIBRATED_MASK)

#define OCOTP_OUT_STATUS_CLR_READ_DONE_INTR_MASK (0x400000U)
#define OCOTP_OUT_STATUS_CLR_READ_DONE_INTR_SHIFT (22U)
/*! READ_DONE_INTR - Read fuse done */
#define OCOTP_OUT_STATUS_CLR_READ_DONE_INTR(x)   (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_READ_DONE_INTR_SHIFT)) & OCOTP_OUT_STATUS_CLR_READ_DONE_INTR_MASK)

#define OCOTP_OUT_STATUS_CLR_READ_ERROR_INTR_MASK (0x800000U)
#define OCOTP_OUT_STATUS_CLR_READ_ERROR_INTR_SHIFT (23U)
/*! READ_ERROR_INTR - Fuse read error */
#define OCOTP_OUT_STATUS_CLR_READ_ERROR_INTR(x)  (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_READ_ERROR_INTR_SHIFT)) & OCOTP_OUT_STATUS_CLR_READ_ERROR_INTR_MASK)

#define OCOTP_OUT_STATUS_CLR_DED0_MASK           (0x1000000U)
#define OCOTP_OUT_STATUS_CLR_DED0_SHIFT          (24U)
/*! DED0 - Double error detect */
#define OCOTP_OUT_STATUS_CLR_DED0(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_DED0_SHIFT)) & OCOTP_OUT_STATUS_CLR_DED0_MASK)

#define OCOTP_OUT_STATUS_CLR_DED1_MASK           (0x2000000U)
#define OCOTP_OUT_STATUS_CLR_DED1_SHIFT          (25U)
/*! DED1 - Double error detect */
#define OCOTP_OUT_STATUS_CLR_DED1(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_DED1_SHIFT)) & OCOTP_OUT_STATUS_CLR_DED1_MASK)

#define OCOTP_OUT_STATUS_CLR_DED2_MASK           (0x4000000U)
#define OCOTP_OUT_STATUS_CLR_DED2_SHIFT          (26U)
/*! DED2 - Double error detect */
#define OCOTP_OUT_STATUS_CLR_DED2(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_DED2_SHIFT)) & OCOTP_OUT_STATUS_CLR_DED2_MASK)

#define OCOTP_OUT_STATUS_CLR_DED3_MASK           (0x8000000U)
#define OCOTP_OUT_STATUS_CLR_DED3_SHIFT          (27U)
/*! DED3 - Double error detect */
#define OCOTP_OUT_STATUS_CLR_DED3(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_CLR_DED3_SHIFT)) & OCOTP_OUT_STATUS_CLR_DED3_MASK)
/*! @} */

/*! @name OUT_STATUS_TOG - 8K OTP Memory STATUS Register */
/*! @{ */

#define OCOTP_OUT_STATUS_TOG_SEC_MASK            (0x200U)
#define OCOTP_OUT_STATUS_TOG_SEC_SHIFT           (9U)
/*! SEC - Single Error Correct */
#define OCOTP_OUT_STATUS_TOG_SEC(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_SEC_SHIFT)) & OCOTP_OUT_STATUS_TOG_SEC_MASK)

#define OCOTP_OUT_STATUS_TOG_DED_MASK            (0x400U)
#define OCOTP_OUT_STATUS_TOG_DED_SHIFT           (10U)
/*! DED - Double error detect */
#define OCOTP_OUT_STATUS_TOG_DED(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED_MASK)

#define OCOTP_OUT_STATUS_TOG_LOCKED_MASK         (0x800U)
#define OCOTP_OUT_STATUS_TOG_LOCKED_SHIFT        (11U)
/*! LOCKED - Word Locked */
#define OCOTP_OUT_STATUS_TOG_LOCKED(x)           (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_LOCKED_SHIFT)) & OCOTP_OUT_STATUS_TOG_LOCKED_MASK)

#define OCOTP_OUT_STATUS_TOG_PROGFAIL_MASK       (0x1000U)
#define OCOTP_OUT_STATUS_TOG_PROGFAIL_SHIFT      (12U)
/*! PROGFAIL - Programming failed */
#define OCOTP_OUT_STATUS_TOG_PROGFAIL(x)         (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_PROGFAIL_SHIFT)) & OCOTP_OUT_STATUS_TOG_PROGFAIL_MASK)

#define OCOTP_OUT_STATUS_TOG_ACK_MASK            (0x2000U)
#define OCOTP_OUT_STATUS_TOG_ACK_SHIFT           (13U)
/*! ACK - Acknowledge */
#define OCOTP_OUT_STATUS_TOG_ACK(x)              (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_ACK_SHIFT)) & OCOTP_OUT_STATUS_TOG_ACK_MASK)

#define OCOTP_OUT_STATUS_TOG_PWOK_MASK           (0x4000U)
#define OCOTP_OUT_STATUS_TOG_PWOK_SHIFT          (14U)
/*! PWOK - Power OK */
#define OCOTP_OUT_STATUS_TOG_PWOK(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_PWOK_SHIFT)) & OCOTP_OUT_STATUS_TOG_PWOK_MASK)

#define OCOTP_OUT_STATUS_TOG_FLAGSTATE_MASK      (0x78000U)
#define OCOTP_OUT_STATUS_TOG_FLAGSTATE_SHIFT     (15U)
/*! FLAGSTATE - Flag state */
#define OCOTP_OUT_STATUS_TOG_FLAGSTATE(x)        (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_FLAGSTATE_SHIFT)) & OCOTP_OUT_STATUS_TOG_FLAGSTATE_MASK)

#define OCOTP_OUT_STATUS_TOG_SEC_RELOAD_MASK     (0x80000U)
#define OCOTP_OUT_STATUS_TOG_SEC_RELOAD_SHIFT    (19U)
/*! SEC_RELOAD - Indicates single error correction occured on reload */
#define OCOTP_OUT_STATUS_TOG_SEC_RELOAD(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_SEC_RELOAD_SHIFT)) & OCOTP_OUT_STATUS_TOG_SEC_RELOAD_MASK)

#define OCOTP_OUT_STATUS_TOG_DED_RELOAD_MASK     (0x100000U)
#define OCOTP_OUT_STATUS_TOG_DED_RELOAD_SHIFT    (20U)
/*! DED_RELOAD - Indicates double error detection occured on reload */
#define OCOTP_OUT_STATUS_TOG_DED_RELOAD(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED_RELOAD_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED_RELOAD_MASK)

#define OCOTP_OUT_STATUS_TOG_CALIBRATED_MASK     (0x200000U)
#define OCOTP_OUT_STATUS_TOG_CALIBRATED_SHIFT    (21U)
/*! CALIBRATED - Calibrated status */
#define OCOTP_OUT_STATUS_TOG_CALIBRATED(x)       (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_CALIBRATED_SHIFT)) & OCOTP_OUT_STATUS_TOG_CALIBRATED_MASK)

#define OCOTP_OUT_STATUS_TOG_READ_DONE_INTR_MASK (0x400000U)
#define OCOTP_OUT_STATUS_TOG_READ_DONE_INTR_SHIFT (22U)
/*! READ_DONE_INTR - Read fuse done */
#define OCOTP_OUT_STATUS_TOG_READ_DONE_INTR(x)   (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_READ_DONE_INTR_SHIFT)) & OCOTP_OUT_STATUS_TOG_READ_DONE_INTR_MASK)

#define OCOTP_OUT_STATUS_TOG_READ_ERROR_INTR_MASK (0x800000U)
#define OCOTP_OUT_STATUS_TOG_READ_ERROR_INTR_SHIFT (23U)
/*! READ_ERROR_INTR - Fuse read error */
#define OCOTP_OUT_STATUS_TOG_READ_ERROR_INTR(x)  (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_READ_ERROR_INTR_SHIFT)) & OCOTP_OUT_STATUS_TOG_READ_ERROR_INTR_MASK)

#define OCOTP_OUT_STATUS_TOG_DED0_MASK           (0x1000000U)
#define OCOTP_OUT_STATUS_TOG_DED0_SHIFT          (24U)
/*! DED0 - Double error detect */
#define OCOTP_OUT_STATUS_TOG_DED0(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED0_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED0_MASK)

#define OCOTP_OUT_STATUS_TOG_DED1_MASK           (0x2000000U)
#define OCOTP_OUT_STATUS_TOG_DED1_SHIFT          (25U)
/*! DED1 - Double error detect */
#define OCOTP_OUT_STATUS_TOG_DED1(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED1_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED1_MASK)

